//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НичегоНеДано()","НичегоНеДано","Дано НичегоНеДано");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"Параметр1Равен(Парам01)","Параметр1Равен","Когда Параметр1 равен 2");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"Параметр2Равен(Парам01)","Параметр2Равен","И  Параметр2 Равен 2");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатРавен(Парам01)","РезультатРавен","Тогда Результат равен 4");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано 2
//@_(Парам01)
Процедура _(Парам01) Экспорт
	Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить("я тута");
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Когда Параметр1 равен 2
//@Параметр1Равен(Парам01)
Процедура Параметр1Равен(Парам01) Экспорт
	Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Если Парам01<>2 Тогда
	
		ВызватьИсключение "Не реализовано.";

		
	
	КонецЕсли; 
	
	КонецПроцедуры

&НаКлиенте
//И  Параметр2 Равен 2
//@Параметр2Равен(Парам01)
Процедура Параметр2Равен(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда Результат равен 4
//@РезультатРавен(Парам01)
Процедура РезультатРавен(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Дано НичегоНеДано
//@НичегоНеДано()
Процедура НичегоНеДано() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить("тцт");
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры
